[
  {
    "username": "Joshua Elstein",
    "review": "Dr Garland is amazing. This office is clean, professional and easy to work with. They are solution based and have made my skincare journey much easier. Highly Recommend!",
    "rating": 5.0,
    "months_ago": 0,
    "time_text": "4 days ago",
    "title": "A Journey to Professional Service"
  },
  {
    "username": "Drea A",
    "review": "Dr Garland is great & efficient! Office staff is also friendly and helpful. Doctor knew exactly what to do with my dermatology issue and fixed it so quickly! I will definitely be coming back for other issues. 5/5!",
    "rating": 5.0,
    "months_ago": 2,
    "time_text": "2 months ago",
    "title": "Exactly What I Needed"
  },
  {
    "username": "Dawn Lauterman",
    "review": "This office is phenomenal! Very warm and welcoming, I have seen Garland Lee for five years. She’s saved my life, she takes her time and is very attentive and personable. She knows what she’s doing every time and spends time to talk over what is needed.",
    "rating": 5.0,
    "months_ago": 5,
    "time_text": "5 months ago",
    "title": "Perfect in Every Way"
  },
  {
    "username": "J T",
    "review": "I had an exceptional experience with Garland Lee, RPA-C, and her medical team. Their professionalism, compassion, and attention to detail made me feel comfortable and well-cared for throughout my visit. I highly recommend them for anyone seeking top-notch healthcare!",
    "rating": 5.0,
    "months_ago": 3,
    "time_text": "3 months ago",
    "title": "Great Visit Experience"
  },
  {
    "username": "David Go",
    "review": "I've been going to DLS for about seven years now. I've\nalways had a pleasant experience; Garland is super sweet and helpful. I've had chronic atopic dermatitis ever since I was a kid and  nothing I've tried has ever worked. She recommended a specialty medication called Dupixent(brand new at the time) and it has a life changing!",
    "rating": 5.0,
    "months_ago": 3,
    "time_text": "3 months ago",
    "title": "Helpful Service Experience"
  },
  {
    "username": "Albert Lee",
    "review": "I’ve been coming to DLS Flatiron since at least 2011, but probably much longer. The entire team there has been like family to me. They have worked hard to overcome insurance challenges and always maintain a high standard of care. And they actually keep to their appointment times (NYers, you know what I’m talking about)! Thank you Garland and the DLS Flatiron team for always taking care of me.",
    "rating": 5.0,
    "months_ago": 3,
    "time_text": "3 months ago",
    "title": "Exceptional Care Experience"
  },
  {
    "username": "Kathryn Waalkes",
    "review": "I’ve been coming here for at least four or five years. Garland and all the other staff are very friendly and professional and always make me feel at ease, which is definitely not the case at every practice. 10/10.",
    "rating": 5.0,
    "months_ago": 3,
    "time_text": "3 months ago",
    "title": "Professional Service Experience"
  },
  {
    "username": "Kayla",
    "review": "When I say Garland Lee saved my skin, I mean she SAVED my skin. I was breaking out so badly for the first time in my entire life at 27. She prescribed me two medicines, was super honest about how long it would take to see results and what I should expect. It's been over a year now and (not to brag) my skin is PERFECT. She made it look better than it's ever looked.\n\nI cannot stress enough how much I love their practice. If you're thinking about seeing anyone about your skin, see them. They're real with you and you'll see serious results.",
    "rating": 5.0,
    "months_ago": 6,
    "time_text": "6 months ago",
    "title": "Great Results Experience"
  },
  {
    "username": "Hannah Perrin",
    "review": "I have never had a bad experience here. Everyone is very friendly and efficient. I adore Garland Lee! She takes her time and talks you through what she is doing. She is also very honest and helpful! She makes you comfortable and is also so kind!",
    "rating": 5.0,
    "months_ago": 9,
    "time_text": "9 months ago",
    "title": "Comfort and Satisfaction Experience"
  },
  {
    "username": "Nicholas Smith",
    "review": "My partner and I have been seeing Garland Lee, PA, for our annual skin screenings for 3 years. This is a very reliable office with good service!",
    "rating": 5.0,
    "months_ago": 3,
    "time_text": "3 months ago",
    "title": "Service Beyond Expectations"
  },
  {
    "username": "Christoph Kienzle",
    "review": "Dr Lee was really nice, explained everything in detail, and seemed much more thorough & genuinely concerned compared to other dermas Ive been to; will be back!",
    "rating": 5.0,
    "months_ago": 0,
    "time_text": "a month ago",
    "title": "A Wonderful Experience"
  },
  {
    "username": "Ula Mikus",
    "review": "I struggle with keloid scars and this is the second time they helps me fix it like nothing ever happened. The first time I broke my nose and had a big plus shaped scar on my nose. I was worried what this will turn out but it’s basically invisible now.",
    "rating": 5.0,
    "months_ago": 0,
    "time_text": "a month ago",
    "title": "Couldn't Ask for Better"
  },
  {
    "username": "Camille Curtis",
    "review": "The front desk staff was lovely! Went for a skin check by Janelle who was amazing. Super helpful. Would definitely come back",
    "rating": 5.0,
    "months_ago": 2,
    "time_text": "2 months ago",
    "title": "Amazing Experience Experience"
  },
  {
    "username": "GLORY SETO",
    "review": "I went in for an appointment with PA Garland Lee. She was friendly and attentive to my skin issues. She was able to quickly resolve it and gave me tips on what I can use. The office staff were friendly as well. The place was clean.",
    "rating": 5.0,
    "months_ago": 7,
    "time_text": "7 months ago",
    "title": "Excellent Appointment"
  },
  {
    "username": "Tirzha Herman",
    "review": "If I could rate DLS of Flatiron more than 5 stars, I would! I've been seeing Garland Lee regularly for the past 3 years for hormonal acne & VI peels. She has out-of-this-world bedside manner, continually makes me feel at ease and comfortable with her during my visits. It doesn't stop with her - the staff are just as extraordinary! When I walked into the office for my visit today, I was warmly remembered & welcomed which brightened up my mood & day exponentially! I can't express how thankful I am to have met Garland & the entire DLS staff - thank you all for what you do!",
    "rating": 5.0,
    "months_ago": 9,
    "time_text": "9 months ago",
    "title": "Excellent Visit"
  },
  {
    "username": "Sarah Hughes",
    "review": "I've always had good experiences here, Garland has helped me through some gnarly skin issues and she's such a warm and kind person.  Definitely recommend as a long time patient who has been going for years!",
    "rating": 5.0,
    "months_ago": 8,
    "time_text": "8 months ago",
    "title": "Kind Service Experience"
  },
  {
    "username": "Lindsay Hart",
    "review": "Dr. Garland Lee is the absolute best! I’ve been seeing her for a few years now for everything from annual skin checks to baby Botox. Not only is she an excellent doctor, she is kind, down to earth, and a true joy to chat with!",
    "rating": 5.0,
    "months_ago": 8,
    "time_text": "8 months ago",
    "title": "A Journey to Kind Service"
  },
  {
    "username": "Evan Chen",
    "review": "This practice really saved my skin.\nI have been coming here for a little bit over a year now. The receptionists and medical staff are professional and lovely which made booking and attending appointments nice and easy. The provider, Garden Lee, has been so sweet and caring. She is knowledgeable and took her time to explain about medications/procedures and listened to my skin concerns. Which gave me confidence to adhere to the treatment plans. 10/10 would recommend!",
    "rating": 5.0,
    "months_ago": 0,
    "time_text": "a year ago",
    "title": "Renewed Confidence Experience"
  },
  {
    "username": "John Taylor",
    "review": "Garland was amazing! She helped with biopsies for moles on my back and a cortisone shot in my eye for a stye. Very professional and knowledgeable. Would highly recommend. No wait time too.",
    "rating": 5.0,
    "months_ago": 9,
    "time_text": "9 months ago",
    "title": "Finding Professional Service"
  },
  {
    "username": "Nina Belamarich",
    "review": "Garland has helped me so much when I started getting hormonal acne. Although the facials and procedures she suggested were expensive, they were totally worth it. And when I said I couldn’t afford them, she had plenty of other low-cost suggestions. Everyone that works there is really nice and attentive. I would definitely suggest DLS flatiron.",
    "rating": 5.0,
    "months_ago": 9,
    "time_text": "9 months ago",
    "title": "Excellent Procedure"
  },
  {
    "username": "Franquelina M Pena",
    "review": "Due to COVID19, I was not sure to visit the any doctor unless it was an emergency but Dermatology, Laser and Surgery of Flatiron PLLC made my visit secure and pleasant.\nSince the time I called, I noticed they were following CDC guidelines. They demanded to fill out, email the registration form before the appointment, and advised that in order to have an in-person visit; I needed to agree to their COVID-19 policy (wear facemask, screening questions, and temperature check) otherwise I was welcomed to book a virtual visit.\nI had a wonderful experience, the front desk and the staff were very friendly and polite. They presented themselves in a positive, professional manner. I appreciated the cleanliness of the waiting room, examination room and restroom.\nMy appointment with Dr. Jessica Feig went good. She answered all the questions I had. She took time to address all my concerns. I have been using the products she prescribe me and my skin is glowing again! SkinMedic- Exfoliating Cleanser / Twice a week and Elta MD-Tinted Sunscreen.",
    "rating": 5.0,
    "months_ago": 48,
    "time_text": "4 years ago",
    "title": "Great Surgery Experience"
  },
  {
    "username": "Sara Renee",
    "review": "The best dermatologist! Appreciate that they are serious about mole/skin checks and help with other typical dermatology issues. But they also have amazing laser and more cosmetic procedures in the office. The front staff are all so kind and easy to schedule with. I see Garland Lee and she’s amazing. Great bedside manner and easy to talk with. She’s helped with multiple skin biopsies and the V-Beam laser which was great! Won’t go anywhere else!",
    "rating": 5.0,
    "months_ago": 0,
    "time_text": "a year ago",
    "title": "Great Procedure Experience"
  },
  {
    "username": "Beatriz Franco",
    "review": "I LOVE LOVE LOVE this office,  from the  very helpful and knowledgeable office manager Ada, to the accommodating ladies at the front desk, to the medical assistants and the doctors/PA’s everyone is always putting caring and friendly. I absolutely love Garland, she’s the BEST P.A. I’ve ever had. She’s so smart and knowledgeable and her treatments al has work. I suffered from severe cystic acne and she is heaven sent with the series of peels and topical lotions she recommended. I highly recommend this place ! You will have a great experience and a red carpet ready glowing skin.",
    "rating": 5.0,
    "months_ago": 0,
    "time_text": "a year ago",
    "title": "Great Treatment Experience"
  },
  {
    "username": "K",
    "review": "Lee and the rest of the medical staff at this location were so professional and kind. Making the appointment was fast and easy and they called ahead of time to make sure I was ready. Lee checked me right away and immediately identified what was going on with my skin, she reassured me that it could be treated and then prescribed the proper medication. A week and a half later, I was already healing back to normal. I'm so grateful because I was nervous I had something super serious, but they knew how to handle it. Thank you.",
    "rating": 5.0,
    "months_ago": 0,
    "time_text": "a year ago",
    "title": "Outstanding Appointment"
  },
  {
    "username": "Jen Sclafani",
    "review": "Gartland Lee is patient and thorough. I trust her advice and highly recommend her and the practice.",
    "rating": 5.0,
    "months_ago": 3,
    "time_text": "3 months ago",
    "title": "Highly Recommended Experience"
  },
  {
    "username": "Brianna Madrigal",
    "review": "I started treatments at this clinic about two years ago and it completely changed my life. I cannot thank Garland Lee, and the rest of the staff (shout out to Linda!), for the amazing care each and every time I receive when I visit. My skin's health has completely transformed since my first appointment and I've regained confidence I haven't had in years. When I book an appointment, I can rest assure that my skin is always in the best hands.\n\nHighly recommend for anyone considering.",
    "rating": 5.0,
    "months_ago": 24,
    "time_text": "2 years ago",
    "title": "Completely Satisfied"
  },
  {
    "username": "Bonita Applebum",
    "review": "Called to schedule an appointment & they were able to book me for my treatment right away. The schedule is a little busy for procedures but they were still able to accommodate me with a time & date that worked for me. Very friendly staff, nice clean office ( the office manager even offered me coffee & water as I sat to wait), and knowledgeable providers. I felt very comfortable and happy with my visit. I'll definitely be coming back!",
    "rating": 5.0,
    "months_ago": 0,
    "time_text": "a year ago",
    "title": "Outstanding Procedure"
  },
  {
    "username": "rolando hernandez",
    "review": "This practice is absolutely the best.. Garland, the P.A. Is an amazing and super thorough, gentle at her approach and nice… the office staff is very helpful and accommodating! Ada, the office manager is willing to go above and beyond to make sure your questions and issues (if any) are answered and resolved. Highly recommend this practice for medical derm and cosmetic treatments.",
    "rating": 5.0,
    "months_ago": 0,
    "time_text": "a year ago",
    "title": "A Journey to Amazing Experience"
  },
  {
    "username": "Gabriela Bravo",
    "review": "No idea what the other reviews are referring to but I’ve had nothing but stellar care at DLS from front care staff to the providers. I’ve been coming to this office for both medical and cosmetic procedures for years now. I’m always greeted with hello and a warm smile. Reception is always very helpful with booking appts at convenient times and pricing for procedures/visits. Garland Lee is my go-to from a troublesome pimple to getting cosmetic touch ups. She’s always super attentive and knowledgeable of all the latest recommendations that would be of interest. I don’t trust my Botox to anyone but her. She’s super soothing and very conservative with how much/little should be done. Can’t recommend DLS enough to anyone needing a dermatologist in the area.",
    "rating": 5.0,
    "months_ago": 0,
    "time_text": "a year ago",
    "title": "A Journey to Exceptional Care"
  },
  {
    "username": "Diana Koss",
    "review": "The front staff is friendly and the care of treatment is amazing! Ive been seeing Garland for my hormonal acne over the last several years. She is very thorough in her approach and has offered a number of solutions that best fit my needs. She takes the time to listen and has really helped me!",
    "rating": 5.0,
    "months_ago": 9,
    "time_text": "9 months ago",
    "title": "Excellent Treatment"
  },
  {
    "username": "Allyson Munoz",
    "review": "Dr. Lee is the absolute best! I feel like I’m catching up with my friend each time. I’m actually moving out of the country next month and super sad to be leaving her! I fully recommend her and the whole company. They’re all fabulous!",
    "rating": 5.0,
    "months_ago": 0,
    "time_text": "a year ago",
    "title": "A Journey to Highly Recommended"
  },
  {
    "username": "Carrigan Dall",
    "review": "BEST STAFF EVER!!! I have been trying to get this mila spot on my eye removed FOREVER. I’ve gone to multiple different places that denied me, but the staff here took me right away and, even at the end of their workday, removed the spot in less than 10 minutes with no pain or complications to compensate for my busy schedule. They were so sweet and welcoming, and as a young girl who just moved to NYC, I couldn’t have found a better spot. AMAZING, AMAZING, AMAZING!!!!! Highly recommend.",
    "rating": 5.0,
    "months_ago": 0,
    "time_text": "a year ago",
    "title": "Relief Experience"
  },
  {
    "username": "taylor melenovsky",
    "review": "Cannot recommend this practice enough. They are so efficient, clean and kind. They helped with multiple skin concerns and were eager to help me feel and look better. I especially recommend Dr. Garland Lee. It’s so difficult to find accessible dermatologists in the city and this office is it.",
    "rating": 5.0,
    "months_ago": 0,
    "time_text": "a year ago",
    "title": "Finding Kind Service"
  },
  {
    "username": "Melissa Wood",
    "review": "I've been going to Garland for years for basically everything to do with my skin from screenings to cosmetic procedures, and she is simply the best! She is so kind and knowledgeable with great bedside manner. I know Garland is always honest with me about what I might actually need versus just trying to sell me services, and I'm a very loyal customer to her and DLS of Flatiron. They also have deals once in a while that are affordable and easy to maintain if you're a repeat customer. 2 sessions of the V beam to get rid of my redness changed my life, and so did the help she gave me with my constant sweating. If you're looking for a dermatologist in NYC, you can feel good about making an appointment here - they're friendly, experienced, and helpful. Ask for Garland! :)",
    "rating": 5.0,
    "months_ago": 48,
    "time_text": "4 years ago",
    "title": "Friendly Service Experience"
  },
  {
    "username": "Yasmin Medragh",
    "review": "The front desk is SUPER welcoming & extremely helpful. All of the staff here is more than friendly & knowledgeable. The provider I saw was very helpful reach my skincare goals. Will be sending all of my friends & family here!!",
    "rating": 5.0,
    "months_ago": 9,
    "time_text": "9 months ago",
    "title": "Finding Exceptional Care"
  },
  {
    "username": "Katy Hannon",
    "review": "Can’t say enough about how great Dr. Garland Lee and her team are. They make you feel so welcome and taken care of. So grateful to have finally found a great derm in the city!",
    "rating": 5.0,
    "months_ago": 0,
    "time_text": "a year ago",
    "title": "Truly Grateful"
  },
  {
    "username": "eric ramm",
    "review": "I had a great experience with Flatiron Dermatology! Dr. Garland Lee was the best!!! I highly recommend going to her and I've been to several places before and couldn't be happier. She is very professional and really made me feel that the trip in from New Jersey was worth it. I just edited my 1st review, I had a second appointment and she is great. She really pays attention to detail. I trust her opinion. Good doctor.",
    "rating": 5.0,
    "months_ago": 48,
    "time_text": "4 years ago",
    "title": "Great Appointment Experience"
  },
  {
    "username": "Marc Newman",
    "review": "My experience at DLS Flatiron has been life-changing. After coming to this practice, I was finally able to get to a solution for a serious skin condition that worked for me. Dr. Garland Lee is a fantastic doctor. She is knowledgeable, friendly, and easy to work with. The rest of the staff is equally as helpful and friendly, too. Highly recommended.",
    "rating": 5.0,
    "months_ago": 24,
    "time_text": "2 years ago",
    "title": "Excellent Staff Experience"
  },
  {
    "username": "Yasmin Medragh",
    "review": "One of the best Derm offices in the city! Clean office, lovely & friendly front desk staff, extremely helpful & knowledgeable medical providers & assistants. Everyone here always makes me feel comfortable & usually pretty short wait time. HIGHLY RECCOMEND! *****",
    "rating": 5.0,
    "months_ago": 11,
    "time_text": "11 months ago",
    "title": "A Journey to Comfort and Satisfaction"
  },
  {
    "username": "Antonella Babino",
    "review": "Love !! Did 3 treatments and they were all good experiences.",
    "rating": 5.0,
    "months_ago": 2,
    "time_text": "2 months ago",
    "title": "Outstanding Treatment"
  },
  {
    "username": "John Kwon",
    "review": "This is a nice welcoming office and I appreciate getting seen in on time of my appointment and not having to wait too long. I've seen Garland Lee for a couple of skin concerns and she has been patient and thorough in explaining to my what procedures are available to me. Will continue going for the wonderful service and care.",
    "rating": 5.0,
    "months_ago": 84,
    "time_text": "7 years ago",
    "title": "Five-Star Service"
  },
  {
    "username": "Julia H",
    "review": "My experience at DLS Flatiron has been great! Garland Lee (the PA) is so friendly, and so is the rest of the team. She always asks me how I'm doing and doubles down on the questions/covers all her bases. The ladies at the desk are always so helpful, and if I need to reschedule anything or need an emergency video visit, they always help me out and take care of things super efficiently. Same goes for the Medical Assistants, they're super responsive and always ask good questions. Two or three times now I have needed to reschedule to a video visit for schedule purposes and they somehow make it work with everything they're juggling, which I really appreciate. I always feel safe and comfortable and listened to at DLS, and I would recommend them highly to anyone I know seeking a dermatologist. I haven't personally explored their more cosmetic offerings (laser or surgery), but as far as skin care goes, they knock it out of the park.",
    "rating": 5.0,
    "months_ago": 36,
    "time_text": "3 years ago",
    "title": "Excellent Surgery"
  },
  {
    "username": "Neo Ng",
    "review": "Dr. Lee at DLS is an AMAZING doctor. She’s knowledgeable, personable, and offers realistic and flexible treatment. I never felt pressured into any treatment, and always felt supported by her and her team. Love this place!\n\n(for reference: I received laser therapy for psoriasis on the back of my scalp, once a week for about a month. Really helped!)",
    "rating": 5.0,
    "months_ago": 24,
    "time_text": "2 years ago",
    "title": "Exceptional Treatment"
  },
  {
    "username": "Kim Tran",
    "review": "I regularly visit Garland and have also worked with Dr. Feig. They have always quickly treated medical issues and been very helpful with information for cosmetic treatments too. Really appreciate their patience, thoroughness, and positivity. Staff is also very friendly and using my insurance/payments has been really timely and easy.",
    "rating": 5.0,
    "months_ago": 36,
    "time_text": "3 years ago",
    "title": "Impressive Treatment"
  },
  {
    "username": "Ula Mikus",
    "review": "I switched 3 dermatologist and this was the fourth one to manage my scar. I had a big cut on my nose from an accident and the scar was not healing well. I had Kelly. But they did miracles with it.",
    "rating": 5.0,
    "months_ago": 7,
    "time_text": "7 months ago",
    "title": "Consistently Excellent"
  },
  {
    "username": "Jay Rivera",
    "review": "I made an appointment via zoc doc a few hours prior. I met with the physicians assistant (Garland Lee) and an aesthetician (lovely young lady who’s name I can’t remember). Everyone I met in the office was pleasant, thorough, & the PA listened to all my concerns, looked up what I was actively using and informed me of what I should & should not pair with which. I couldn’t have asked for a better experience, and the product prescribed has worked dramatically in already three days after just one use. Highly highly highly recommend!",
    "rating": 5.0,
    "months_ago": 24,
    "time_text": "2 years ago",
    "title": "Finding Highly Recommended"
  },
  {
    "username": "Maria Cruz",
    "review": "I have been coming here for the past 8 years! If that isn’t dedication I don’t know what is! I highly recommend this practice and often tell my friends to see my favorite doctor, Dr Garland! Dr Garland has literally saved my skin from this dirty NYC air. I’m forever grateful for her! They have the highest standards re: COVID procedures which has made it easy to come visit them. Also make sure to speak to my bestie there, Claudia! She has helped me when my insurance was acting up! Overall, they will definitely take care of you here and treat you like family.",
    "rating": 5.0,
    "months_ago": 48,
    "time_text": "4 years ago",
    "title": "Exceptional Procedure"
  },
  {
    "username": "John Robbins",
    "review": "The level of care and service is excellent! I recently saw Garland for an eyelid infection that she diagnosed immediately and was able to set the right course of treatment without surgery. I had already visited two ophthalmologists, but they failed to diagnose properly and their course of treatment actually created other skin irritation issues. I highly recommend this practice.",
    "rating": 5.0,
    "months_ago": 48,
    "time_text": "4 years ago",
    "title": "Outstanding Surgery"
  },
  {
    "username": "Teresa Brown",
    "review": "I had the Clear and Brilliant with Garland Lee.  She is the best.  I highly recommend going here, they offer other services as well.  I was comfortable and the staff was great.  I only wish i had known that the Clear and Brilliant they offer for a certain price was for that day only purchase. Which I did not know, or would have bought.\nI highly recommend !",
    "rating": 5.0,
    "months_ago": 48,
    "time_text": "4 years ago",
    "title": "Finding Comfort and Satisfaction"
  },
  {
    "username": "Earnest",
    "review": "I have been going to this office and seeing Garland (PA) for a few years now.  This office is great and never have any issues. Even though they are busy, Garland finds the time to talk to me and treats me like a friend than patient!  Thank you!!!!",
    "rating": 5.0,
    "months_ago": 24,
    "time_text": "2 years ago",
    "title": "True Professionals"
  },
  {
    "username": "William Callahan",
    "review": "Great service, efficient appointments, and good people! Garland Lee and her assistants are fantastic - always a good experience",
    "rating": 5.0,
    "months_ago": 7,
    "time_text": "7 months ago",
    "title": "Exceptional Quality and Service"
  },
  {
    "username": "Mark Georgacopoulos",
    "review": "Wonderful practice. Thoughtful, kind and knowledge team! Highly recommend",
    "rating": 5.0,
    "months_ago": 3,
    "time_text": "3 months ago",
    "title": "Amazing Team Experience"
  },
  {
    "username": "Devon Hay",
    "review": "Dr. Lee is so friendly, approachable and reassuring in all appointments. I have a very dominant history of skin cancer in my family, and I feel like the practice really has my back with my preventative care plan. She and her staff are very caring, particularly during moments when I I have experienced anxiety during appointments or procedures. Thank you for all that you do to keep me healthy.",
    "rating": 5.0,
    "months_ago": 60,
    "time_text": "5 years ago",
    "title": "Impressive Procedure"
  },
  {
    "username": "judy m",
    "review": "I've been coming here to see Garland for years. Garland is super professional, talented and patient.  The ladies who tend the desk are really nice and knowledgeable as well. I highly recommend them for any of your dermatological needs. You also can't beat the convenient location, right by the FlatIron and Union Square.",
    "rating": 5.0,
    "months_ago": 48,
    "time_text": "4 years ago",
    "title": "Outstanding Experience"
  },
  {
    "username": "Simon Willcocks",
    "review": "Dr. Garland Lee - after switching between dermatologists for over two years, I finally met Dr. Lee and my search is over! Diligently professional, with one of the finest patient interactions I've ever had the pleasure to be part of,  Dr. Lee has helped me with a number of medical issues. She has energy and passion for her role, understands the importance of listening to the patient, and is always happy to discuss the options available. No problem whatsoever recommending her to anyone. I will shortly be moving away from the area, but am very happy to make the extra journey just to continue seeing Dr. Lee.",
    "rating": 5.0,
    "months_ago": 72,
    "time_text": "6 years ago",
    "title": "Exceeded All Expectations"
  },
  {
    "username": "Jackie Haranzo",
    "review": "I've been seeing Garland Lee for a few years now and she is the BEST! She is so friendly and my skin has never looked better - I've gotten all my friends and coworkers to go to her now and everyone loves this practice.",
    "rating": 5.0,
    "months_ago": 24,
    "time_text": "2 years ago",
    "title": "A Journey to Friendly Service"
  },
  {
    "username": "Aaron Romero",
    "review": "Friendly and efficient. Never have to wait. Excellent bedside manner.",
    "rating": 5.0,
    "months_ago": 3,
    "time_text": "3 months ago",
    "title": "Finding Friendly Service"
  },
  {
    "username": "Adam B",
    "review": "New patient and had a very good experience with the staff especially with reception and the PA. Good professional attitude. Very patient and informative to questions I had. Will come back.",
    "rating": 5.0,
    "months_ago": 8,
    "time_text": "8 months ago",
    "title": "Beyond Impressed"
  },
  {
    "username": "Richard Chen",
    "review": "I had a neck rash last year for which Garland L. of this practice was SO so so helpful, empathetic, and truly caring. The total of 7 appointments over about 6 months addressed an allergy test (disclaimed to be infamously inaccurate, but we went over all the results in finer detail to be truthful about what was likely a cause), various ointments, and ultimately enough talking about the resolution to reach a good one. Her care, attention, listening, and intellect all helped me to get past a very trying era in my life, so thank you Garland!",
    "rating": 5.0,
    "months_ago": 60,
    "time_text": "5 years ago",
    "title": "Exceptional Appointment"
  },
  {
    "username": "Rosena Enaje",
    "review": "I have been getting my peels here for over 3 years here. The staff is extremely competent and professional, and my skin always looks amazing! Garland did my last peel and I got so many complements from my friends and peers! My skin felt so smooth and soft, I am hooked! I already have my next peel scheduled for next month.",
    "rating": 5.0,
    "months_ago": 84,
    "time_text": "7 years ago",
    "title": "Absolutely Delighted"
  },
  {
    "username": "Daniel Sussman",
    "review": "I've been going here for like 5+ years now - they are the best. The whole staff is great and Garland has been treating my acne and scarring with a soft touch. They also never try to sell me anything I don't need, which I really appreciate.",
    "rating": 5.0,
    "months_ago": 36,
    "time_text": "3 years ago",
    "title": "A Journey to Excellent Staff"
  },
  {
    "username": "Samantha Macrae",
    "review": "Really enjoy the staff here, always very helpful and accommodating. Love Garland Lee, she’s the best! Always feel like they take their time with me and don’t feel rushed. I always recommend this place to my friends.",
    "rating": 5.0,
    "months_ago": 48,
    "time_text": "4 years ago",
    "title": "Finding Excellent Staff"
  },
  {
    "username": "Weronika Yuan",
    "review": "I've been treated under dr Garland Lee for the past few months. She has been very helpful with my acne problem and even convinced me I should do extractions (covered by insurance), to which I was hesitant. However, I did notice improvement and will continue to come for routine cleaning. Unfortunately there's no miracle solution to any dermatological problems, it takes lots of patience as well as trial and error. My skin has improved a little bit and dr Lee still has a few more things to propose. I firmly believe that together, we will eliminate my skin problem.",
    "rating": 5.0,
    "months_ago": 84,
    "time_text": "7 years ago",
    "title": "A Journey to Helpful Service"
  },
  {
    "username": "Julia Lourdes",
    "review": "I've been going here for the last 8 months and they're super great! The staff is lovely and Dr. Lee took care of me so well. Her recommendations have helped improve my skin immensely and it looks so much better than it did when I first started coming here!",
    "rating": 5.0,
    "months_ago": 60,
    "time_text": "5 years ago",
    "title": "Exceptional Care Experience 1"
  },
  {
    "username": "Scott Workman",
    "review": "Garland was fantastic very thorough with my skin exam,  She may be the best of them all. Aeri was also terrific",
    "rating": 5.0,
    "months_ago": 0,
    "time_text": "a year ago",
    "title": "Excellent Examination"
  },
  {
    "username": "Alice Kerry",
    "review": "I’ve been seeing Garland Lee for a few years here, and highly recommend her. She’s really friendly and knowledgeable and takes great care of my skin. It’s always a pleasure going into the office.",
    "rating": 5.0,
    "months_ago": 48,
    "time_text": "4 years ago",
    "title": "Exceptional Care Experience 2"
  },
  {
    "username": "Jonathan Flynn",
    "review": "I was able to get a quick appointment on short notice to have some skin tags removed that were bothering me around my eyes.  Garland performed the procedure and after a couple of days of healing, they were completely gone.  It looked great.  Professional place geared towards customer satisfaction!",
    "rating": 5.0,
    "months_ago": 72,
    "time_text": "6 years ago",
    "title": "Quick Service Experience"
  },
  {
    "username": "Carlos Aguilar-Castillo",
    "review": "I saw Dr. Jessica Feig who was great. She addressed my concern and offered me good options for treatment. The staff is excellent and very friendly but most off all I like that I wasn't made to wait in waiting room with other patients. They did express check in and took me straight to exam room. I was able to wash my hands in their was station outside the exam rooms. All in all it was a great experience and good place and I felt very safe.",
    "rating": 5.0,
    "months_ago": 48,
    "time_text": "4 years ago",
    "title": "Great Treatment Experience 1"
  },
  {
    "username": "Jennifer Allbee",
    "review": "I’ve been seeing dr. Garland for several years for Vbeam laser procedures and cosmetic procedures like Botox. I love her super professional demeanor and upbeat attitude. She really listens to my needs & cares about my skin needs. Couldn’t recommend her and the flatiron practice more!",
    "rating": 5.0,
    "months_ago": 36,
    "time_text": "3 years ago",
    "title": "Professional Service Experience 1"
  },
  {
    "username": "Amber DeGagne",
    "review": "Garland Lee was fantastic to work with. I had some discoloration on my face due to sun exposure and with the recommended treatment, my discoloration disappeared in weeks! Super easy and solve my problem quickly! Will go back again.",
    "rating": 5.0,
    "months_ago": 36,
    "time_text": "3 years ago",
    "title": "A Journey to Quick Service"
  },
  {
    "username": "Lexi Lawson",
    "review": "I Love this place!  I had the Clear and Brilliant treatment for the second time on my face and neck ( with almost zero downtime - it looks like a sun burn for under 24 hours ) and my skin looks exactly what it says - CLEAR and Brilliant! In addition - they are a super friendly staff, wonderful caring service, they are always willing to offer the best pricing, and on top of it gave me a goodie bag full of products to congratulate me on having a baby/ my birthday.",
    "rating": 5.0,
    "months_ago": 60,
    "time_text": "5 years ago",
    "title": "Caring Approach Experience"
  },
  {
    "username": "Steve Capece Jr",
    "review": "10/10. High Referral to contact Garland Lee, PA because her Upmost Care in treating My Skin including V- Beam for post inflammatory erythema, corticosteroid injections for a hypertrophic scar and cyst, and hyfrecation. Her treatments have prevailed. My skin is looking good and healthy. Garland Lee, PA is Very Knowledgeable and Works with you on pricing for treatments. I Love Garland Lee, PA.",
    "rating": 5.0,
    "months_ago": 36,
    "time_text": "3 years ago",
    "title": "Exceptional Care Experience 3"
  },
  {
    "username": "Jonathan Schwartz",
    "review": "I’ve been seeing Dr. Lee for the last few years and she’s always the best! Super thorough and always helpful answering any question I have. Thank you!!",
    "rating": 5.0,
    "months_ago": 9,
    "time_text": "9 months ago",
    "title": "Finding Helpful Service"
  },
  {
    "username": "Laine Weber Callahan",
    "review": "Love this place! Highly recommend Garland. She’s the best!! So thorough - will always come back here.",
    "rating": 5.0,
    "months_ago": 0,
    "time_text": "a year ago",
    "title": "Highly Recommended Experience 1"
  },
  {
    "username": "isabel summers",
    "review": "I am smiling! My face is smooth and radiant with a lovely glow after the new Pumpkin Enzyme Facial from the PCA line! I feel special and pampered during my visits, and there is always a skip to my step when I leave--especially because there is no down-time!. I’ve been a long-standing happy patient of this outstanding practice. They are exceptional doctors and practitioners whose professionalism and courtesy are unparalleled. More than that, they are artists who take pride in the delicate work of bringing about beauty.",
    "rating": 5.0,
    "months_ago": 72,
    "time_text": "6 years ago",
    "title": "Outstanding Visit"
  },
  {
    "username": "Griffin Blass",
    "review": "Very professional and doesn’t waste your time, 100% recommend",
    "rating": 5.0,
    "months_ago": 3,
    "time_text": "3 months ago",
    "title": "Professional Service Experience 2"
  },
  {
    "username": "Jasmine",
    "review": "Dr. Feig is absolutely AMAZING. From day 1, I could tell she knew her stuff. Another doctor in the city misdiagnosed me with a condition, and I came to Dr. Feig for a second opinion. Not only did she immediately spot the misdiagnosis, but also, she confirmed the misdiagnosis by sending out lab testing for confirmation. When I saw her breadth of knowledge, on top of her thorough approach to reviewing my situation, I knew I was staying with her practice.  She actually listens to my concerns, presents me with options, walks me through the pros and cons of each option, and takes the time to ensure I'm satisfied with our course of action. She's fantastic and I highly recommend seeing Dr. Feig!!",
    "rating": 5.0,
    "months_ago": 48,
    "time_text": "4 years ago",
    "title": "Finding Amazing Experience"
  },
  {
    "username": "Sharmaine Sottile",
    "review": "Garland is the best PA! She’s patient, very knowledgeable and takes the time to explain. I appreciate the thoroughness and her expertise.",
    "rating": 5.0,
    "months_ago": 24,
    "time_text": "2 years ago",
    "title": "Expert Knowledge Experience"
  },
  {
    "username": "Catherine Clark",
    "review": "I have been going to them for over a year. My skin is clear and gorgeous. Everything has been done gently, with wonderful instructions and a staff that is amazing. I will not use anyone else in NYC.",
    "rating": 5.0,
    "months_ago": 24,
    "time_text": "2 years ago",
    "title": "Amazing Experience Experience 1"
  },
  {
    "username": "Joen Kroft",
    "review": "Dr. Connie Yang is the best! She literally safe my life. We found a suspicious mole and we did everything to get rid of asap. Thank you!!! Johana",
    "rating": 5.0,
    "months_ago": 0,
    "time_text": "a year ago",
    "title": "A Wonderful Experience 1"
  },
  {
    "username": "Gabrielle Gantz",
    "review": "Great experience. Short wait time, very nice staff, and lots of good information shared during the checkup and procedure. Highly recommended.",
    "rating": 5.0,
    "months_ago": 0,
    "time_text": "a year ago",
    "title": "Great Procedure Experience 1"
  },
  {
    "username": "Jo Herlihy",
    "review": "My first experience and the office staff put me instantly at ease.  They made me feel welcome and calmed my nerves.  Pleasant atmosphere and excellent and knowledgeable doctors.  Can’t wait to go back and would recommend to everyone",
    "rating": 5.0,
    "months_ago": 84,
    "time_text": "7 years ago",
    "title": "Excellent Staff Experience 1"
  },
  {
    "username": "Jenny Seto",
    "review": "Very clean office, welcoming staff, one stop shop. Garland Lee is professional, patient, kind, and super helpful by letting me know my options. Will continue to come here!",
    "rating": 5.0,
    "months_ago": 84,
    "time_text": "7 years ago",
    "title": "Professional Service Experience 3"
  },
  {
    "username": "Kristal Singh",
    "review": "Amazing, friendly staff. Doctors are knowledgeable, patient and kind. I’ve been visiting this office for acne concerns and checkups for the past year, they always take the time to listen to concerns and provide great feedback regarding regimen changes and prescriptions.",
    "rating": 5.0,
    "months_ago": 72,
    "time_text": "6 years ago",
    "title": "Great Check-up Experience"
  },
  {
    "username": "Susie Levitt",
    "review": "I had such a great visit today with DLS! They helped inspect my areas of concern with ease and educated me on my skin concerns. Great bedside manner and went above and beyond!! Thanks DLS will be back!",
    "rating": 5.0,
    "months_ago": 60,
    "time_text": "5 years ago",
    "title": "Exceptional Visit"
  },
  {
    "username": "Elizabeth Brice",
    "review": "I've been a patient of this practice for 5+ years, they are truly the best! Highly recommend.",
    "rating": 5.0,
    "months_ago": 0,
    "time_text": "a year ago",
    "title": "Highly Recommended Experience 2"
  },
  {
    "username": "John Favre",
    "review": "Been going there for 15 years. Garland Lee RPA-C is happy and diligent.",
    "rating": 5.0,
    "months_ago": 0,
    "time_text": "a year ago",
    "title": "Happiness Experience"
  },
  {
    "username": "CML",
    "review": "Top notch care- the staff is quick, thorough, and knowledgeable. This is high praise coming from a guy who usually avoids Doctor Offices like the plague. Would recommend for anyone seeking dermatology treatment",
    "rating": 5.0,
    "months_ago": 60,
    "time_text": "5 years ago",
    "title": "Finding Quick Service"
  },
  {
    "username": "Judy Moy",
    "review": "Garland Lee was fantastic. I found her to be patient, caring and professional.",
    "rating": 5.0,
    "months_ago": 60,
    "time_text": "5 years ago",
    "title": "Professional Service Experience 4"
  },
  {
    "username": "Nilgul Kirimca",
    "review": "Love this place- staff nice and friendly- Garland Lee is great!!! very thorough with appointments and explanation of things.",
    "rating": 5.0,
    "months_ago": 72,
    "time_text": "6 years ago",
    "title": "Impressive Appointment"
  },
  {
    "username": "Natalie Ricci",
    "review": "Best office I been to. Saw the PA and Dr. Bhanusali. Both smart. Great skin exam and lip fillers!",
    "rating": 5.0,
    "months_ago": 84,
    "time_text": "7 years ago",
    "title": "Great Examination Experience"
  },
  {
    "username": "Charlie Boardman",
    "review": "Professional, friendly, thorough, flexible. I’ve been to many dermatologists and this is top tier. I’ll be making it my primary derm.",
    "rating": 5.0,
    "months_ago": 36,
    "time_text": "3 years ago",
    "title": "Professional Service Experience 5"
  },
  {
    "username": "Bruce Wilson",
    "review": "Fantastic all around",
    "rating": 5.0,
    "months_ago": 6,
    "time_text": "6 months ago",
    "title": "A Wonderful Experience 2"
  },
  {
    "username": "Kevin King",
    "review": "Quick and excellent service.",
    "rating": 5.0,
    "months_ago": 0,
    "time_text": "a year ago",
    "title": "Quick Service Experience 1"
  },
  {
    "username": "Bonnie Schwartz Nolan",
    "review": "Garland Lee is amazing!",
    "rating": 5.0,
    "months_ago": 36,
    "time_text": "3 years ago",
    "title": "Amazing Experience Experience 2"
  },
  {
    "username": "Jean Cooney",
    "review": "👍🏽",
    "rating": 5.0,
    "months_ago": 84,
    "time_text": "7 years ago",
    "title": "A Wonderful Experience 3"
  },
  {
    "username": "Angela Maria L.",
    "review": "Great off and doctors",
    "rating": 5.0,
    "months_ago": 84,
    "time_text": "7 years ago",
    "title": "A Wonderful Experience 4"
  },
  {
    "username": "Jennifer Kanjana",
    "review": "",
    "rating": 5.0,
    "months_ago": 2,
    "time_text": "2 months ago",
    "title": "Great Experience"
  },
  {
    "username": "Sonia Halbach",
    "review": "",
    "rating": 5.0,
    "months_ago": 5,
    "time_text": "5 months ago",
    "title": "Highly Recommend"
  },
  {
    "username": "Derek Balarezo",
    "review": "",
    "rating": 5.0,
    "months_ago": 6,
    "time_text": "6 months ago",
    "title": "Excellent Service"
  },
  {
    "username": "JulieAnn Oliveras",
    "review": "",
    "rating": 5.0,
    "months_ago": 84,
    "time_text": "7 years ago",
    "title": "Five-Star Experience"
  },
  {
    "username": "Anishka Brewer",
    "review": "",
    "rating": 5.0,
    "months_ago": 84,
    "time_text": "7 years ago",
    "title": "Top-Notch Service"
  },
  {
    "username": "Rodahline Dy Macatangay",
    "review": "",
    "rating": 5.0,
    "months_ago": 84,
    "time_text": "7 years ago",
    "title": "Outstanding Results"
  }
]